// Задача №1
// Баланс користувача зберігається у змінній balanse
// Сума покупки зберігається у змінній payment

// Перед перевіркою вивсти повідомлення:
// - "Загальна вартість товару замовлення [число] кредитів.
//     Перевіряєм кількість доступних коштів на рахунку"

// - Ящо сума покупки не перевищує баланс:
//      - Вирахувати із баланмса суму покупки
//      - Вивести повідомлення
//      "На рахунку залишилось [число] кредитів"

// - Якщо сума покупки перевищує баланс:
//      -Вивести повідомлення
//      "На рахунку не достатньо коштів для проведення операції!"

// - В кінці вивести повідомлення
//      "Операція завершена"

// let balanse = 10000;
// const payment = 2000;


// ................................

// Задача №2
// Напиши скрипт підрахунку суми зі скидкою в залежності
// від потраченої суми за весь час (партнерська програма)

// - Загальна сума витрачених коштів зберігається в змінній
// totalSpent
// - Сума поточного платежа зберігається у змінній
// discount

// Якщо потрачено від [100 до 1000) - бронзовий партнер, знижка 2%
// Якщо потрачено від [1000 до 5000) - срібний партнер, знижка 5%
// Якщо потрачено від [5000  - золотий партнер, знижка 10%
// Якщо потрачено меньше 100) - не партнер, знижка 0%

// - В результаті вивести повідомлення
// "Оформлюємо замовлення на суму [сума] зі знижкою [знижка]"

// const totalSpent = 5000;
// let payment = 500;
// let discount = 0;

// .............................

// Задача №3
// if...else і prompt
// //Використавши інструкцію if..else, напиши код, який буде питатись:
// «Яка кількість місяців в році». Якщо користувач вводить 12,
// то показати: «Вірно!», в протилежному випадку – вивести відповідь:
// «Не вірно!»

// .....................


// Задача №4
// написати програму яка питає у користувача період підписки
// на сервіс і показувати ціну підписки
// спочатку if else потім switch
 
// Якщо ввів День - ціна 1.99
// Якщо Тиждень - ціна 5.99
// Якщо місяць - ціна 10.99
// Якщо рік - ціна 100.99

// .....................

// Задача№5
// Тернарний оператор
// // Перепиши if...else з використанням тернарного оператора.

const a = 1;
const b = 2;
let result;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Багато';
// }



// console.log(result);

