// Напишіть скрипт вибору вартості готелю по кількості зірок
// 1 - 20$, 2 - 30$, 3 - 50$,  4- 70$, 5 -120$


// Якщо у змінній stars щось інше від чисел 1-5,
// виведи строку
// "Такої кількості зірок немає"

// const stars = 5;
// let price;

// if(stars === 1){
//     price = 20;
// }else if(stars === 2){
//     price = 30;
// } else if ( stars === 3){
//     price = 50
// } else if( stars === 4){
//     price = 70
// } else if ( stars === 5){
//     price = 120 
// }
// console.log("Такої кількості зірок немає")

// switch ( stars){
//     case 1: 
//     case 2:
//       price = 20;
//       break;

      

//         case 3 :
//         case 4:
//             price = 50;
//             break;
             
      

//         case 5:
//             price = 120;
//             break;
// default:
//     console.log("Такої кількості зірок немає");

// }
// console.log(price);

// ....................................

// напиши скрипт вибору вартості готелю по кількості зірок
// 1,2 - 20$, 3,4 - 30$, 5 -120$

// const stars = 1;
// let price;

// if(stars === 1 || stars ===2){
//     price = 20;
// }else if(stars === 3 || stars=== 4){
//     price = 30;

// } else if ( stars === 5){
//     price = 120 
//     console.log("Такої кількості зірок немає")
// }

// .....................................

// Напиши скрипт вибору оцінки доставки товару
// Опція зберігається у змінній
// option: 1 - самовивіз, 2 - курєр, 3 - пошта

// У змінну message записати повідломлення
//  в залежності від опції
// - "Ви можете забрати товар завтра з 12:00 у нашому офісі"
// - "Курєр доставить замовлення завтра з 9:00 до 18:00"
// - "Посилка буде відправлена сьогодні"
// - "Вам передзвонить менеджер"

// 1)  зробити змінну
const option =1;
let message;
// 2) зробити свіч 1, 2, 3
// 3) і у кожен кейс записати строку
switch(option){
    case 1:
        message = "Ви можете забрати товар завтра з 12:00 у нашому офісі"
        break;

        case 2:
            message = "Курєр доставить замовлення завтра з 9:00 до 18:00"
            break
            case 3:
                message = "Посилка буде відправлена сьогодні"
        default:
            message = "Вам передзвонить менеджер"         
}
console.log(message)


